{
    "CLASS": "Blueprint for creating objects.",
    "OBJECT": "An instance of a class.",
    "ENCAPSULATION": "Hiding internal details and exposing only necessary parts.",
    "ABSTRACTION": "Hiding complex implementation details and showing only the relevant features.",
    "INHERITANCE": "Mechanism to derive a class from another class.",
    "POLYMORPHISM": "Ability to take multiple forms (method overriding and overloading).",
    "CONSTRUCTOR": "Special method used to initialize an object.",
    "DESTRUCTOR": "Special method called when an object is deleted.",
    "INTERFACE": "A contract that a class must follow by implementing its methods.",
    "METHOD": "A function inside a class.",
    "ATTRIBUTE": "A variable inside a class.",
    "INSTANCE": "A specific realization of a class.",
    "OVERLOADING": "Defining multiple methods with the same name but different parameters.",
    "OVERRIDING": "Redefining a method in a derived class.",
    "COMPOSITION": "Designing a class to include objects of other classes.",
    "AGGREGATION": "A weaker form of composition where objects can exist independently.",
    "ASSOCIATION": "Relationship between two classes without ownership.",
    "STATIC": "A keyword indicating a method or variable belongs to the class, not an instance.",
    "GETTER": "A method used to retrieve the value of an attribute.",
    "SETTER": "A method used to set the value of an attribute.",
    "ELEMENT": "A basic building block of an HTML document.",
    "TAG": "Used to define elements in an HTML document.",
    "DOCTYPE": "Declares the document type and HTML version.",
    "ANCHOR": "An HTML element used to create hyperlinks.",
    "FORM": "Used to collect user input.",
    "INPUT": "An element for user data entry fields.",
    "IFRAME": "Embeds another webpage inside a document.",
    "META": "Provides metadata like charset and viewport settings.",
    "SCRIPT": "Embeds or links JavaScript code in an HTML file.",
    "SELECTOR": "Targets HTML elements to apply styles.",
    "PROPERTY": "Defines aspects of styling like color or font-size.",
    "VALUE": "Specifies the effect of a CSS property.",
    "FLEXBOX": "A CSS layout model for arranging elements efficiently.",
    "GRID": "A powerful layout system in CSS for creating two-dimensional designs.",
    "PSEUDO": "A keyword used to style elements based on their state (e.g., :hover).",
    "TRANSITION": "Creates smooth animations between CSS states.",
    "MEDIA": "A rule used to apply styles based on screen size.",
    "VARIABLE": "Stores a value that can change during program execution.",
    "FUNCTION": "A reusable block of code that performs a task."
}